<template>

</template>

<script>
  // 49平台
  const URL = 'http://119.3.219.49:8082/';
  //49前端-文件
  const EXPORTURL = 'http://119.3.219.49:8081/';
  //高管中心网址
  const GGZXURL = 'http://119.3.219.49:8099/#/';
  //服务区
  const FWQURL = 'http://119.3.219.49:8197/#/';

  // //229平台
  // const URL = 'http://119.3.236.229:8082/';
  // //229前端-基础设施
  // const EXPORTURL = 'http://119.3.236.229:8081/';

  // //交通厅平台(外网ip)
  // let URL = 'http://218.206.237.216:8081/';
  // //交通厅前端-平台整合
  // let EXPORTURL = 'http://218.206.237.216:8087/';
  //高管中心网址
  //const GGZXURL = 'http://218.206.237.216:8087/#/';
  //服务区
  //const FWQURL = 'http://218.206.237.216:8088/#/';

  // //交通厅平台(内网ip)
  // const URL = 'http://10.217.25.88:8081/';
  // //交通厅前端-平台整合
  // const EXPORTURL = 'http://10.217.25.88:8087/';
  //高管中心网址
  //const GGZXURL = 'http://10.217.25.88:8087/#/';
  //服务区
  //const FWQURL = 'http://10.217.25.88:8088/#/';

  //49周南高速后台
  const URLZN = 'http://119.3.219.49:8084/';

  //视频平台接口
  const URLSP = 'http://119.3.170.17:80/';


  export default {
    name: "global",
    URL,
    URLZN,
    EXPORTURL,
    GGZXURL,
    FWQURL,
    URLSP,
    x_PI:3.14159265358979324 * 3000.0 / 180.0,
    PI:3.1415926535897932384626,
    a:6378245.0,
    ee:0.00669342162296594323,
    MCBAND:[12890594.86, 8362377.87, 5591021, 3481989.83, 1678043.12, 0],
    LLBAND:[75, 60, 45, 30, 15, 0],
    MC2LL:[
      [1.410526172116255e-8, 0.00000898305509648872, -1.9939833816331, 200.9824383106796, -187.2403703815547, 91.6087516669843, -23.38765649603339, 2.57121317296198, -0.03801003308653, 17337981.2],
      [-7.435856389565537e-9, 0.000008983055097726239, -0.78625201886289, 96.32687599759846, -1.85204757529826, -59.36935905485877, 47.40033549296737, -16.50741931063887, 2.28786674699375, 10260144.86],
      [-3.030883460898826e-8, 0.00000898305509983578, 0.30071316287616, 59.74293618442277, 7.357984074871, -25.38371002664745, 13.45380521110908, -3.29883767235584, 0.32710905363475, 6856817.37],
      [-1.981981304930552e-8, 0.000008983055099779535, 0.03278182852591, 40.31678527705744, 0.65659298677277, -4.44255534477492, 0.85341911805263, 0.12923347998204, -0.04625736007561, 4482777.06],
      [3.09191371068437e-9, 0.000008983055096812155, 0.00006995724062, 23.10934304144901, -0.00023663490511, -0.6321817810242, -0.00663494467273, 0.03430082397953, -0.00466043876332, 2555164.4],
      [2.890871144776878e-9, 0.000008983055095805407, -3.068298e-8, 7.47137025468032, -0.00000353937994, -0.02145144861037, -0.00001234426596, 0.00010322952773, -0.00000323890364, 826088.5]
    ],
    LL2MC:[
      [-0.0015702102444, 111320.7020616939, 1704480524535203, -10338987376042340, 26112667856603880, -35149669176653700, 26595700718403920, -10725012454188240, 1800819912950474, 82.5],
      [0.0008277824516172526, 111320.7020463578, 647795574.6671607, -4082003173.641316, 10774905663.51142, -15171875531.51559, 12053065338.62167, -5124939663.577472, 913311935.9512032, 67.5],
      [0.00337398766765, 111320.7020202162, 4481351.045890365, -23393751.19931662, 79682215.47186455, -115964993.2797253, 97236711.15602145, -43661946.33752821, 8477230.501135234, 52.5],
      [0.00220636496208, 111320.7020209128, 51751.86112841131, 3796837.749470245, 992013.7397791013, -1221952.21711287, 1340652.697009075, -620943.6990984312, 144416.9293806241, 37.5],
      [-0.0003441963504368392, 111320.7020576856, 278.2353980772752, 2485758.690035394, 6070.750963243378, 54821.18345352118, 9540.606633304236, -2710.55326746645, 1405.483844121726, 22.5],
      [-0.0003218135878613132, 111320.7020701615, 0.00369383431289, 823725.6402795718, 0.46104986909093, 2351.343141331292, 1.58060784298199, 8.77738589078284, 0.37238884252424, 7.45]
    ],
    bd09togcj02(bd_lon, bd_lat) {
      let x_pi = 3.14159265358979324 * 3000.0 / 180.0;
      let x = bd_lon - 0.0065;
      let y = bd_lat - 0.006;
      let z = Math.sqrt(lng * lng + lat * lat) + 0.00002 * Math.sin(lat * this.x_PI);
      let theta = Math.atan2(lat, lng) + 0.000003 * Math.cos(lng * this.x_PI);
      let gg_lng = z * Math.cos(theta);
      let gg_lat = z * Math.sin(theta);
      return [gg_lng, gg_lat];
    },
    gcj02tobd09(lng,lat){
      /*let lat1 = +lat;
      let lng1 = +lng;*/
      let z = Math.sqrt(lng * lng + lat * lat) + 0.00002 * Math.sin(lat * this.x_PI);
      let theta = Math.atan2(lat, lng) + 0.000003 * Math.cos(lng * this.x_PI);
      let bd_lng = z * Math.cos(theta) + 0.0065;
      let bd_lat = z * Math.sin(theta) + 0.006;
      return [bd_lng, bd_lat];
    },
    wgs84togcj02(lng,lat){
      /*let lat = +lat;
      let lng = +lng;*/
      if (this.out_of_china(lng, lat)) {
        return [lng, lat]
      } else {
        let dlat = this.transformlat(lng - 105.0, lat - 35.0);
        let dlng = this.transformlng(lng - 105.0, lat - 35.0);
        let radlat = lat / 180.0 * this.PI;
        let magic = Math.sin(radlat);
        magic = 1 - this.ee * magic * magic;
        let sqrtmagic = Math.sqrt(magic);
        dlat = (dlat * 180.0) / ((this.a * (1 - this.ee)) / (magic * sqrtmagic) * this.PI);
        dlng = (dlng * 180.0) / (this.a / sqrtmagic * Math.cos(radlat) * this.PI);
        let mglat = lat + dlat;
        let mglng = lng + dlng;
        return [mglng, mglat];
      }
    },
    transformlat(lng,lat){
      /*let lat = +lat;
      let lng = +lng;*/
      let ret = -100.0 + 2.0 * lng + 3.0 * lat + 0.2 * lat * lat + 0.1 * lng * lat + 0.2 * Math.sqrt(Math.abs(lng));
      ret += (20.0 * Math.sin(6.0 * lng * this.PI) + 20.0 * Math.sin(2.0 * lng * this.PI)) * 2.0 / 3.0;
      ret += (20.0 * Math.sin(lat * this.PI) + 40.0 * Math.sin(lat / 3.0 * this.PI)) * 2.0 / 3.0;
      ret += (160.0 * Math.sin(lat / 12.0 * this.PI) + 320 * Math.sin(lat * this.PI / 30.0)) * 2.0 / 3.0;
      return ret;
    },
    transformlng(lng,lat){
      /*let lat = +lat;
      let lng = +lng;*/
      let ret = 300.0 + lng + 2.0 * lat + 0.1 * lng * lng + 0.1 * lng * lat + 0.1 * Math.sqrt(Math.abs(lng));
      ret += (20.0 * Math.sin(6.0 * lng * this.PI) + 20.0 * Math.sin(2.0 * lng * this.PI)) * 2.0 / 3.0;
      ret += (20.0 * Math.sin(lng * this.PI) + 40.0 * Math.sin(lng / 3.0 * this.PI)) * 2.0 / 3.0;
      ret += (150.0 * Math.sin(lng / 12.0 * this.PI) + 300.0 * Math.sin(lng / 30.0 * this.PI)) * 2.0 / 3.0;
      return ret;
    },
    out_of_china(lng,lat){
      /*let lat = +lat;
      let lng = +lng;*/
      // 纬度3.86~53.55,经度73.66~135.05
      return !(lng > 73.66 && lng < 135.05 && lat > 3.86 && lat < 53.55);
    },
  }
</script>

<style scoped>

</style>
